//Примечание: Эта ката вдохновлена ​​упражнением «Преобразовать число в строку!» . Попробуйте выполнить и его тоже.
//Описание
//Нам нужна функция, которая может преобразовывать строку в число. Какие способы вы знаете для этого?
//Примечание: Не беспокойтесь, все входные данные будут строками, и каждая строка является вполне допустимым представлением целого числа.
//https://www.codewars.com/kata/544675c6f971f7399a000e79/train/java
public class Main {
    public static void main(String[] args) {


    }
    public static int stringToNumber(String str) {
        return Integer.parseInt(str);
    }
}