public class Main {
    public static void main(String[] args) {


        System.out.println(makeUpperCase("hello world"));
    }


    public static String makeUpperCase(String str) {
        return str.toUpperCase();
    }
}


// Напишите функцию, которая преобразует входную строку в верхний регистр.
// https://www.codewars.com/kata/57a0556c7cb1f31ab3000ad7/train/java